Dlubal.RFEM5.ConnectionSideType
Side where is the hinge placed

Dlubal.RFEM5.ConnectionSideType.UnknownConnectionSideType
Hinge is on unknown side

Dlubal.RFEM5.ConnectionSideType.StartSideType
Hinge is on none side

Dlubal.RFEM5.ConnectionSideType.EndSideType
Hinge is on the left side